[
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "medium",
    "question_type": "multiple_choice",
    "question_text": "How do you diagnose and resolve display issues that aren't related to complete video failure?",
    "answer_options": [
      "Display issues only occur due to software problems and require reinstalling applications",
      "Check resolution settings, refresh rates, color depth, cable quality, monitor compatibility",
      "Display problems are always caused by network connectivity issues",
      "All display issues require immediate replacement of the graphics card"
    ],
    "correct_answer": ["Check resolution settings, refresh rates, color depth, cable quality, monitor compatibility"],
    "explanation": "Display issues (distortion, wrong colors, flickering) require systematic checking: 1) Verify resolution and refresh rate settings, 2) Test different color depths, 3) Check cable quality and connections, 4) Test monitor with different source, 5) Update graphics drivers, 6) Check for electromagnetic interference, 7) Verify monitor specifications match output capabilities.",
    "tags": ["display issues"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "easy",
    "question_type": "multiple_choice",
    "question_text": "What are common monitor problems and how do you distinguish them from graphics card issues?",
    "answer_options": [
      "Monitor problems only affect brightness and have no other symptoms",
      "Dead pixels, backlight failure, power issues - test with different source to isolate from graphics card",
      "All monitor problems automatically indicate graphics card failure",
      "Monitor problems only occur during specific software applications"
    ],
    "correct_answer": ["Dead pixels, backlight failure, power issues - test with different source to isolate from graphics card"],
    "explanation": "Monitor problems include: dead pixels, backlight failure, power issues, button malfunctions, and physical damage. Distinguish from graphics card issues by: testing monitor with different source (laptop, phone), checking for problems across all inputs, verifying power LED status, and testing known good monitor with suspect system.",
    "tags": ["monitor problems"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "hard",
    "question_type": "multiple_choice",
    "question_text": "What constitutes screen failure and what are the different types you might encounter?",
    "answer_options": [
      "Screen failure only refers to complete darkness with no other variations",
      "Complete display loss, partial display, distortion, color problems - hardware or connection related",
      "Screen failure exclusively indicates software corruption issues",
      "All screen failures require operating system reinstallation"
    ],
    "correct_answer": ["Complete display loss, partial display, distortion, color problems - hardware or connection related"],
    "explanation": "Screen failure types: 1) Complete loss (no signal), 2) Partial display (missing sections), 3) Distortion (wavy lines, geometric problems), 4) Color problems (wrong colors, missing color channels), 5) Flickering or intermittent display. Can be caused by cable problems, graphics card failure, monitor defects, or power supply issues.",
    "tags": ["screen failure"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "medium",
    "question_type": "multiple_choice",
    "question_text": "What display hardware components should you check during video troubleshooting?",
    "answer_options": [
      "Only the monitor screen itself without considering other components",
      "Graphics card, monitor, cables, power supplies, motherboard video outputs, adapters",
      "Display hardware problems are always software-related issues",
      "Only internal components without considering external display connections"
    ],
    "correct_answer": ["Graphics card, monitor, cables, power supplies, motherboard video outputs, adapters"],
    "explanation": "Display hardware includes: graphics card (dedicated or integrated), monitor, video cables (VGA, DVI, HDMI, DisplayPort), power supplies (for both PC and monitor), motherboard video outputs, port adapters, and cable converters. Systematic testing of each component helps isolate hardware failures from software issues.",
    "tags": ["display hardware"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "easy",
    "question_type": "multiple_choice",
    "question_text": "What is video output troubleshooting and what are the key things to verify?",
    "answer_options": [
      "Only checking software video player applications and codecs",
      "Verify signal generation from PC, cable integrity, monitor input selection, compatibility",
      "Video output problems are exclusively network streaming issues",
      "Only testing with high-resolution displays and gaming applications"
    ],
    "correct_answer": ["Verify signal generation from PC, cable integrity, monitor input selection, compatibility"],
    "explanation": "Video output troubleshooting verifies: 1) PC generates video signal (test with known good monitor), 2) Cable carries signal properly (test with different cable), 3) Monitor receives and displays signal (check input selection), 4) Resolution/refresh rate compatibility, 5) Proper video output selection (integrated vs dedicated graphics).",
    "tags": ["video output"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "hard",
    "question_type": "multiple_choice",
    "question_text": "What is the process of elimination in motherboard troubleshooting and how do you implement it effectively?",
    "answer_options": [
      "Random removal of components without systematic approach",
      "Systematically remove non-essential components to isolate problems - start with minimal configuration",
      "Process of elimination only applies to software troubleshooting procedures",
      "Immediately replace all components without testing individual parts"
    ],
    "correct_answer": ["Systematically remove non-essential components to isolate problems - start with minimal configuration"],
    "explanation": "Process of elimination for motherboards: 1) Start with minimal configuration (CPU, 1 RAM stick, power), 2) Test basic functionality, 3) Add components one at a time, 4) Test after each addition, 5) When problem appears, last added component is suspect, 6) Remove and retest to confirm. This isolates defective components and prevents damage from faulty parts.",
    "tags": ["process of elimination"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "easy",
    "question_type": "multiple_choice",
    "question_text": "What should you consider regarding motherboard warranty during troubleshooting and repairs?",
    "answer_options": [
      "Warranty considerations are irrelevant during troubleshooting procedures",
      "Check warranty status before disassembly, document problems, follow RMA procedures if covered",
      "All motherboards have lifetime warranties that cover any type of damage",
      "Warranty only covers software issues and never hardware problems"
    ],
    "correct_answer": ["Check warranty status before disassembly, document problems, follow RMA procedures if covered"],
    "explanation": "Motherboard warranty considerations: 1) Check warranty status and terms before opening case, 2) Document problems and symptoms, 3) Take photos of damage if visible, 4) Follow manufacturer's RMA procedures, 5) Avoid actions that void warranty (removing warranty stickers, physical damage from troubleshooting), 6) Keep purchase receipts and original packaging.",
    "tags": ["motherboard warranty"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "medium",
    "question_type": "multiple_choice",
    "question_text": "How do driver issues contribute to motherboard troubleshooting and what is the resolution approach?",
    "answer_options": [
      "Driver issues only affect external peripherals and never motherboard functions",
      "Chipset, BIOS, and component drivers affect stability - update systematically from manufacturer",
      "All driver problems require complete operating system reinstallation",
      "Driver issues are always caused by hardware failure and require replacement"
    ],
    "correct_answer": ["Chipset, BIOS, and component drivers affect stability - update systematically from manufacturer"],
    "explanation": "Driver issues affecting motherboards: chipset drivers, BIOS updates, USB controller drivers, audio drivers, and network drivers. Resolution: 1) Identify motherboard model, 2) Download latest drivers from manufacturer website, 3) Update chipset drivers first, 4) Update BIOS if needed, 5) Update individual component drivers, 6) Test stability after each update.",
    "tags": ["driver issues"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "medium",
    "question_type": "multiple_choice",
    "question_text": "What are software conflicts in motherboard troubleshooting and how do they manifest?",
    "answer_options": [
      "Software conflicts only occur between user applications and don't affect hardware",
      "Driver conflicts, service conflicts, hardware resource conflicts causing instability and crashes",
      "All software conflicts indicate physical hardware damage to motherboard",
      "Software conflicts exclusively affect network connectivity and nothing else"
    ],
    "correct_answer": ["Driver conflicts, service conflicts, hardware resource conflicts causing instability and crashes"],
    "explanation": "Software conflicts affecting motherboards: driver conflicts between different hardware manufacturers, service conflicts from multiple hardware management utilities, resource conflicts (IRQ, DMA, I/O addresses), and compatibility issues between BIOS settings and OS. Symptoms: random crashes, BSOD, device failures, and system instability. Resolution requires systematic driver management and conflict resolution.",
    "tags": ["software conflicts"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "easy",
    "question_type": "multiple_choice",
    "question_text": "What is power switch verification in motherboard troubleshooting and why is it important?",
    "answer_options": [
      "Testing electrical outlets and power cords for proper voltage delivery",
      "Verify case power button connects properly to motherboard and functions correctly",
      "Power switch verification only applies to laptop computers with battery systems",
      "Checking power supply unit efficiency ratings and certification standards"
    ],
    "correct_answer": ["Verify case power button connects properly to motherboard and functions correctly"],
    "explanation": "Power switch verification tests: 1) Check front panel connector attachment to motherboard, 2) Verify correct pin placement for power button, 3) Test by manually shorting power pins on motherboard, 4) Check for stuck or damaged case power button, 5) Verify power LED connections. Important because faulty power switches can prevent system startup entirely.",
    "tags": ["power switch verification"],
    "status": "approved"
  }
]
