[
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "medium",
    "question_type": "multiple_choice",
    "question_text": "What is the proper procedure for component removal during motherboard troubleshooting?",
    "answer_options": [
      "Remove all components simultaneously to save time during troubleshooting",
      "Power off, unplug, ground yourself, document connections, remove systematically one at a time",
      "Component removal only requires disconnecting power without other precautions",
      "Remove components while system is running to test live functionality"
    ],
    "correct_answer": ["Power off, unplug, ground yourself, document connections, remove systematically one at a time"],
    "explanation": "Proper component removal: 1) Power off completely and unplug system, 2) Ground yourself with anti-static wrist strap, 3) Document connections with photos, 4) Remove components systematically one at a time, 5) Store components safely in anti-static bags, 6) Keep screws organized, 7) Test after each removal to isolate problems.",
    "tags": ["component removal"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "hard",
    "question_type": "multiple_choice",
    "question_text": "What constitutes minimal configuration in motherboard troubleshooting and why is it effective?",
    "answer_options": [
      "Using the smallest possible case with compact components for space efficiency",
      "CPU, single RAM stick, power supply, basic video - eliminates variables to isolate problems",
      "Running system with minimum power settings to reduce electrical consumption",
      "Installing only the oldest compatible drivers to ensure maximum compatibility"
    ],
    "correct_answer": ["CPU, single RAM stick, power supply, basic video - eliminates variables to isolate problems"],
    "explanation": "Minimal configuration includes: CPU, single RAM stick, power supply, and basic video output (integrated or single graphics card). This eliminates variables that could cause problems: multiple RAM sticks, expansion cards, extra drives, and unnecessary peripherals. Effective because it isolates core functionality and makes it easier to identify if problems are motherboard-related or component-related.",
    "tags": ["minimal configuration"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "easy",
    "question_type": "multiple_choice",
    "question_text": "What are performance issues in the context of hardware troubleshooting and how do you identify them?",
    "answer_options": [
      "Performance issues only relate to software optimization and application efficiency",
      "Slow operation, reduced throughput, thermal throttling - monitor temps, speeds, benchmarks",
      "Performance problems exclusively indicate network connectivity issues",
      "All performance issues require immediate hardware replacement without testing"
    ],
    "correct_answer": ["Slow operation, reduced throughput, thermal throttling - monitor temps, speeds, benchmarks"],
    "explanation": "Hardware performance issues include: slow operation, reduced throughput, thermal throttling, and component degradation. Identify by: monitoring CPU/GPU temperatures, checking clock speeds, running benchmarks, monitoring resource utilization, checking for dust buildup, and verifying proper cooling operation. Compare results to baseline performance and manufacturer specifications.",
    "tags": ["performance issues"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "medium",
    "question_type": "multiple_choice",
    "question_text": "What is intermittent shutdown and what are the most common causes in desktop systems?",
    "answer_options": [
      "Scheduled automatic shutdowns configured in power management settings",
      "Random unexpected shutdowns - typically caused by overheating, PSU problems, or failing components",
      "User-initiated shutdowns that occur during normal system operation",
      "Network-triggered shutdowns from remote administration tools"
    ],
    "correct_answer": ["Random unexpected shutdowns - typically caused by overheating, PSU problems, or failing components"],
    "explanation": "Intermittent shutdown is random, unexpected system shutdown without user initiation. Common causes: CPU/GPU overheating, power supply instability or failure, failing motherboard components, bad RAM, loose connections, or thermal protection activation. Troubleshoot by monitoring temperatures, testing power supply, checking connections, and running hardware diagnostics.",
    "tags": ["intermittent shutdown"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "hard",
    "question_type": "multiple_choice",
    "question_text": "What are capacitor problems on motherboards and how do they manifest in system behavior?",
    "answer_options": [
      "Capacitor problems only affect audio quality and sound output functions",
      "Bulging caps, leaking electrolyte causing instability, random crashes, power regulation issues",
      "All capacitor issues are cosmetic and don't affect system functionality",
      "Capacitor problems exclusively impact network connectivity and data transfer"
    ],
    "correct_answer": ["Bulging caps, leaking electrolyte causing instability, random crashes, power regulation issues"],
    "explanation": "Capacitor problems manifest as: bulging or leaking capacitors (visual inspection), power regulation issues, random system crashes, boot failures, and component instability. Failed capacitors cause voltage irregularities that affect connected components. Look for physical signs: bulging tops, leaked electrolyte residue, or discoloration around capacitors on motherboard.",
    "tags": ["capacitor problems"],
    "status": "approved"
  },
  {
    "cert_id": ["220-1201"],
    "domain_id": "5.0",
    "domain_title": "Hardware and Network Troubleshooting",
    "subdomain_id": "5.1",
    "difficulty": "easy",
    "question_type": "multiple_choice",
    "question_text": "What role does slot testing play in motherboard troubleshooting and what should you test?",
    "answer_options": [
      "Slot testing only applies to external expansion slots and not internal connections",
      "Test RAM slots, PCIe slots, power connectors - verify proper seating and connection integrity",
      "All slot problems indicate complete motherboard failure requiring replacement",
      "Slot testing is only necessary when installing new components"
    ],
    "correct_answer": ["Test RAM slots, PCIe slots, power connectors - verify proper seating and connection integrity"],
    "explanation": "Slot testing involves: testing RAM slots individually (move RAM to different slots), testing PCIe slots with known good cards, verifying power connector seating and integrity, checking for physical damage or debris in slots. This helps identify: failed memory slots, damaged PCIe slots, poor connections, and intermittent contact issues that cause instability.",
    "tags": ["slot testing"],
    "status": "approved"
  }
]
